<div style=""class="block" align="justify">
<img src="img/dist/inf.jpg" style="float:left; padding-right:5px; padding-bottom:2px; width: 300px;">Информа́тика (от информация и автоматика) — наука о методах и процессах сбора, хранения, обработки, передачи, анализа и оценки информации, обеспечивающих возможность её использования для принятия решений. Также, под информатикой понимают научно-практический подход к вычислению и его применениям, базирующийся на систематическом изучении целесообразности, структуры, выражения и механизации методических процедур (или алгоритмов), которые лежат в основе приобретения, представления, обработки, хранения, передачи и доступа к информации, будь то информация, кодируемая в виде битов в памяти компьютера или записанная в генах и белковых структурах в биологической клетке. Она включает дисциплины, относящиеся к обработке информации в вычислительных машинах и вычислительных сетях: как абстрактные, вроде анализа алгоритмов, так и конкретные, например разработка языков программирования и протоколов передачи данных.
</div>

<div style="font-weight:400; display: flex; padding:0 auto;"class="block">

    <a href="<?php echo $_SERVER['REQUEST_URI'];?>&t=all" style="text-decoration:none; color:#000;"><div style="margin-left: 150px; margin-right: 10px;background: #E4E4E4;" class="sb"><center><p style="padding: 10px 0;
background: #F4F4F4; ">Пройти обучение</p></center>
        
        </div></a>
    

    
    <a href="<?php echo $_SERVER['REQUEST_URI'];?>&t=select" style="text-decoration:none; color:#000;"><div style="background: #E4E4E4;" class="sb"><center><p style="padding: 10px 0;
background: #F4F4F4; ">Выбрать урок</p></center>

        </div></a>
    
      </div>